module.exports={
    err:{
        ru:'Возникла ошибка',
        en:'An error occurred',
        ua:"Виникла помилка"
    },
    invalid:{
        ru:'Неправильное число',
        en:'Invalid value',
        ua:"Некорректне число"
    },
    city:{
        enter:{
            ru:"Введите название города, для которого будет высылаться прогноз погоды",
            en:"Enter the city for weather forecast",
            ua:"Введіть назву міста, для якого буде відсилатися прогноз погоди "
        },
        main:{
            ru:"Город выбран",
            en:"City has been chosen",
            ua:"Місто обране"
        },
        err:{
            ru:"Вероятно вы указали неправильное название города",
            en:'Probably you specified incorrect city name',
            ua:"Вірогідно ви вказали неправильну назву міста"
        }
    },
    time:{
        main:{
            ru:"Введите час (0-23) в которые хотите получать ежедневный прогноз погоды ",
            en:'Enter an hour (0-23) in which daily weather forecast will be sent',
            ua:"Введіть годину (0-23) у яку бажаєте отримувати щоденний прогноз погоди"
        },
        leave:{
            ru:"Прогноз погоды будет высылаться ежедневно в : ",
            en:"Weather forecast will be sent everyday at :",
            ua:"Прогноз погоди буде відправлятися щоденно о : "
        }
    },
    stop:{
        ru:"Ежедневная рассылка прогноза остановлена",
        en:"Daily forecast sending has been disabled",
        ua:"Щоденна відправка прогнозу припинена"
    },
    daytime:{
        night:{
            ru:"Ночь: ",
            en:"Night: ",
            ua:"Ніч: "
        },
        morning:{
            ru:"Утро: ",
            en:"Morning: ",
            ua:"Ранок: "
        },
        afternoon:{
            ru:"День: ",
            en:"Afternoon: ",
            ua:"День: "
        },
        evening:{
            ru:"Вечер: ",
            en:"Evening: ",
            ua:"Вечір: "
        }
    },
    cond:{
        ru:"Состояние: ",
        en:"Condition: ",
        ua:"Стан: "
    },
    temp:{
        ru:"Температура:",
        en:"Temperature:",
        ua:"Температура:"
    },
    hum:{
        ru:"Влажность:",
        en:"Humidity:",
        ua:"Вологість:"
    },
    pres:{
        ru:"Давление:",
        en:"Pressure:",
        ua:"Тиск:"
    },
    unav:{
        ru:"Недоступно",
        en:"Unavailable",
        ua:"Недоступно"
    },
    dateunav:{
        ru:"Прогноз на эту дату недоступен",
        en:"Forecast for this date is unavailable",
        ua:"Прогноз на цю дату недоступний"
    },
    help:{
        ru:"Комманды:\n/setCity - устанавливает город для которого будет присылаться прогноз погоды. По умолчанию: Киев;\n/setTime - устанавливает час в который вам будет прислан прогноз погоды на текущий день. Рекомендуется ставить на утро, чтоб знать насколько тепло одеться или брать ли зонт;\n/stopTimer - отключает предыдущую комманду. После этого /setTime можно будет прописать снова, если понадобится;\n/ru - выбрать русский язык;\n /en - choose english language;\n/help - просмотреть инструкцию;\n\nВозле текстового поля в приложении есть 2 кнопки:\nДата - получение прогноза на указанный день этого месяца, или, если в этом месяце такой день прошел, возьмется такое число следующего месяца. Максимальный сдвиг от текущего дня - 5 дней;\nКол-во - получение прогноза на указанное количество дней начиная с текущего (не больше 5). Например: написав '3' после нажатия кнопки вы получите прогноз на сегодня, завтра и послезавтра.\nУдачного использования!",
        en:"Commands:\n/setCity - specifies the city for weather forecasts. Kiev by default;\n/setTime - specifies an hour at which the daily forecast will be sent. It's recommended to specify morning hours to know if you would need an umbrella or to dress warmly;\n/stopTimer - disables previous command. After that you can write /setTime again if you need;\n/ru - выбрать русский язык;\n/ua - обрати українську мову;\n/en - choose english language;\n/help - get instructions;\n\nYou can see 2 buttons near the text field of app:\nDate - to get a forecast for a specified day of this month, or, if this day has gone over this month, this day of the next month will be picked. Maximal removal from the current day - 5 days;\nAmount - to get a forecast for specified amount of days from current (not more than 5). For example: if you type '3' after pressing the button you will get a forecast for today, tomorrow and the day after tomorrow.\nGood luck using the bot!",
        ua:"Команди:\n/setCity - встановлює місто для якого буде висилатися прогноз погоди. За замовчуванням: Київ;\n/setTime - встановлює годину у яку вам буде відправлено прогноз погоди на поточний день. Рекомендується ставити на ранок, щоб знати наскільки тепло одягтися або чи брати парасольку;\n/stopTimer - відключаю попередню команду. Після цього /setTime можна буде прописати знову, якщо потрібно;\n/ru - выбрать русский язык;\n/ua - обрати українську мову;\n/en - choose english language;\n/help - подивитися інструкцію;\n\nБіля текстового поля в додатку є 2 кнопки:\nДата - отримання прогнозу на вказаний день цього місяца, або, якщо в цьому месяці такий день минув, візьметься таке ж число наступного місяця. Максимальний зсув від поточного дня - 5 днів;\nКільк. - отримання прогнозу на вказану кількість днів починая з поточного (не більше 5). Наприклад: написавши '3' післе нажаття кнопки ви отримаєте прогноз на сьогодні, завтра і післязавтра.\nВдалого використання!"
    },
    date:{
        ru:`Введите число на которое хотите получить прогноз (максимум +5 дней от сегодня). Сегодня: ${new Date().getDate()} число`,
        en:`Enter the day you would like to get a forecast for(max +5 days from today). Today is: ${new Date().getDate()}`,
        ua:`Введіть день на який бажаєте отримати прогноз (максим +5 днів від сьогодні). Сьогодні: ${new Date().getDate()} число`
    },
    am:{
        ru:"Введите количество дней на которое хотите получить прогноз (максимум 5)",
        en:"Enter the amount of days for which you would like to get a forecast (max 5)",
        ua:"Введіть кількість днів на яку ви бажаєте отпримати прогноз (максимум 5)"
    },
    start:"Доброго времени суток. Данный бот присылает прогноз погоды для установленного города на указанные дни (см. ниже)\n\n" +
    "Комманды:\n/setCity - устанавливает город для которого будет присылаться прогноз погоды. По умолчанию: Киев;\n" +
    "/setTime - устанавливает время в которое вам будет прислан прогноз погоды на текущий день. Рекомендуется ставить на утро чтоб знать как одеться или брать ли зонт;\n" +
    "/stopTimer - отключает предыдущую комманду. После этого /setTime можно будет прописать снова;\n" +
    "/ru - выбрать русский язык;\n" +
    "/ua - обрати українську мову;\n" +
    "/en - choose english language;\n" +
    "/help - просмотреть инструкцию;\n\n" +
    "Возле текстового поля в приложении есть 2 кнопки:\n" +
    "Дата - получение прогноза на указанный день этого месяца, или, если в этом месяце такой день прошел, возьмется такое число следующего месяца. Максимальный сдвиг от текущего дня - 5 дней;\n" +
    "Кол-во - получение прогноза на указанное количество дней начиная с текущего (не больше 5). Например: написав '3' после нажатия кнопки вы получите прогноз на сегодня, завтра и послезавтра.\n" +
    "Удачного использования!"
};